MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK61FN1M0VMD15/mcu.h
#define Reserved                      0x1FFFF80000000      // This field is reserved.
#define TRUNC_FL                      0x07FFE000      // Frame Truncation Length


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_TACC register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFFF80000000      // This field is reserved.
#define PROCHK                        0x00000010      // Enables insertion of protocol checksum.
#define IPCHK                         0x00000008      // Enables insertion of IP header checksum.
#define Reserved                      0x0000000C      // This field is reserved.
#define SHIFT16                       0x00000001      // TX FIFO Shift-16


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RACC register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFF80000000      // This field is reserved.
#define SHIFT16                       0x00000080      // RX FIFO Shift-16
#define LINEDIS                       0x00000040      // Enable Discard Of Frames With MAC Layer Errors
#define Reserved                      0x000000E0      // This field is reserved.
#define PRODIS                        0x00000004      // Enable Discard Of Frames With Wrong Protocol Checksum
#define IPDIS                         0x00000002      // Enable Discard Of Frames With Wrong IPv4 Header Checksum
#define PADREM                        0x00000001      // Enable Padding Removal For Short IP Frames


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_PACKETS register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Packet count


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_BC_PKT register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Broadcast packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_MC_PKT register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Multicast packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_CRC_ALIGN register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Packets with CRC/align error


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_UNDERSIZE register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of transmit packets less than 64 bytes with good CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_OVERSIZE register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of transmit packets greater than MAX_FL bytes with good CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_FRAG register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of packets less than 64 bytes with bad CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_JAB register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of transmit packets greater than MAX_FL bytes and bad CRC


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_COL register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of transmit collisions


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_P64 register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of 64-byte transmit packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_P65TO127 register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of 65- to 127-byte transmit packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_P128TO255 register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of 128- to 255-byte transmit packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_P256TO511 register.
//
//*****************************************************************************

#define TXPKTS                        0x7FFF8000      // Number of 256- to 511-byte transmit packets


//*****************************************************************************
//
// The following are defines for the bit fields in the ENET_RMON_T_P512TO1023 register.
//
//*****************************************************************************

